app/controllers/breeds_controller.rb

  def index
      @q = Breed.search(params[:q])
      @breeds = @q.result(distinct: true).order(:name)
---
SELECT "breeds".* FROM "breeds"
SELECT DISTINCT "breeds".* FROM "breeds" ORDER BY "breeds"."name" ASC