app/controllers/facebook_logins_controller.rb

SELECT "users".* FROM "users" WHERE "users"."facebook_id" = '10203878669752601' LIMIT 1
INSERT INTO "users" ("authentication_token", "created_at", "facebook_id", "name", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def check_mobile_login
    token = params[:token]
    user = FbGraph::User.me(token)
    user = user.fetch
    #respond_to do |format|
     #   format.json { render :json => user }
    #end

    logged = User.find_by facebook_id: user.identifier

    if logged.nil?
      @user = User.new
      @user.facebook_id = user.identifier
      @user.authentication_token = @user.generate_authentication_token
      @user.name = user.name
      @user.save!