app/controllers/pets_controller.rb

SELECT "pets".* FROM "pets" ORDER BY "pets"."created_at" ASC
---
def index
	@pets = Pet.order(:created_at)

SELECT "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT 1  [["id", "18"]]
---
def show
	@pet = Pet.find(params[:id])