app/controllers/species_controller.rb

  def index
      @species = Species.all
---
SELECT "species".* FROM "species"